//=======================================================================
// Задача 10: Напишите программу, которая принимает на вход трёхзначное
// число и на выходе показывает вторую цифру этого числа.
//=======================================================================

Console.Write("Введите трехзначное число: ");
string inputNumber = Console.ReadLine()??"";
int number = int.Parse(inputNumber);
Console.Write("Вторая цифра: ");
Console.WriteLine((number % 100)/10);